<?php
// +--------------------------------------------------+
// | Name: config.php
// +--------------------------------------------------+
// | Author: Nathan <www.nanyinet.com>
// +--------------------------------------------------+
// | Copyright (c) 2024 NanYiNet All rights reserved.
// +--------------------------------------------------+
// | Date: 2024-02-25 23:38
// +--------------------------------------------------+
// | Created: PHPStorm
// +--------------------------------------------------+
return [
    'url'=> [
		'title' => '通道域名',
		'type'  => 'text', 
		'value' => '',
		'tip'   => '短信平台的域名 前有http(s):// 后有/，请确保协议头正确',
	],
    'channel'=> [
		'title' => '通道ID',
		'type'  => 'text', 
		'value' => '',
		'tip'   => '短信平台的通道ID，Channel开头的',
	],
	'username'=> [
		'title' => '用户名',
		'type'  => 'text', 
		'value' => '',
		'tip'   => '请填写已经注册的用户名，在API文档中查看用户名',
	],
	'key'=> [
		'title' => '用户Secret Key',
		'type'  => 'text', 
		'value' => '',
		'tip'   => '请填写未进行MD5加密的Secret Key，在API文档中查看',
	],
	'sign'=> [
		'title' => '短信签名',
		'type'  => 'text',
		'value' => '',
		'tip'   => '用已经审核通过的签名，签名到短信官网查看 无需加【】',
	],
];
